---
title: Keyword arguments
date: 2010-05-04
categories: Clojure Lisp programming
---

There’s been an [ongoing][1] [debate][2] about how to pass optional named arguments to Clojure functions. One way to do this is the [defnk][3] macro from `clojure.contrib.def`; I hesitate to call it _canonical_, since apparently not everyone uses it, but I’ve found it useful a number of times. Here’s a sample:

```clojure
user> (use 'clojure.contrib.def)
nil
user> (defnk f [:b 43] (inc b))
#'user/f
user> (f)
44
user> (f :b 100)
101
```

This is an example of _keyword arguments_ in action. Keyword arguments are a core feature of some languages, notably [Common Lisp][4] and [Objective Caml][5]. Clojure doesn’t have them, but it’s pretty easy to emulate their basic usage with macros, as `defnk` does.

But there’s more to Common Lisp’s keyword arguments than `defnk` provides. In CL, the default value of a keyword argument can be an expression referring to other arguments of the same function. For example:

```lisp
CL-USER> (defun f (&key (a 1) (b a))
           (+ a b))
F
CL-USER> (f)
2
CL-USER> (f :a 45)
90
CL-USER> (f :b 101)
102
```

I wish `defnk` had this feature. Or is there some better way that I don’t know of?

 [1]: http://stuartsierra.com/2010/01/15/keyword-arguments-in-clojure
 [2]: http://www.fatvat.co.uk/2009/01/passing-parameters-in-clojure.html
 [3]: http://richhickey.github.com/clojure-contrib/def-api.html#clojure.contrib.def/defnk
 [4]: http://www.gigamonkeys.com/book/functions.html#keyword-parameters
 [5]: http://caml.inria.fr/pub/docs/manual-ocaml/manual006.html#htoc38
